## Plan Result (prod_landing - TerraformPlanApply)




<pre><code>Plan: 35 to add, 3 to change, 0 to destroy.</code></pre>

* Create
  * module.data_landing_zone[&#34;00&#34;].azurerm_bastion_host.this[0]
  * module.data_landing_zone[&#34;00&#34;].azurerm_public_ip.bastion[0]
  * module.data_landing_zone[&#34;00&#34;].azurerm_role_assignment.runtimes_datafactory_storage[&#34;cross-cutting&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_role_assignment.shared_integration_datafactory_storage[&#34;cross-cutting&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_storage_data_lake_gen2_filesystem.this[&#34;cross-cutting&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_storage_management_policy.this[&#34;cross-cutting&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_network_security_group.this[&#34;bastion-nsg&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_network_security_rule.deny_inbound[&#34;bastion-nsg&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_network_security_rule.rules[&#34;bastion-nsg-Bastion-azure-cloud-outbound&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_network_security_rule.rules[&#34;bastion-nsg-Bastion-data-plane-inbound&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_network_security_rule.rules[&#34;bastion-nsg-Bastion-data-plane-outbound&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_network_security_rule.rules[&#34;bastion-nsg-Bastion-gateway-manager-inbound&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_network_security_rule.rules[&#34;bastion-nsg-Bastion-internet-outbound&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_network_security_rule.rules[&#34;bastion-nsg-Bastion-load-balancer-inbound&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_network_security_rule.rules[&#34;bastion-nsg-Bastion-user-inbound&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_network_security_rule.rules[&#34;bastion-nsg-Bastion-vm-outbound&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Allow_Bastion&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-bastion&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;bastion-nsg-vnet-bastion&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;ingest00crosscuttingprod&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;cross-cutting-blob&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;cross-cutting-dfs&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;cross-cutting-blob&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;cross-cutting-dfs&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;cross-cutting&#34;].azapi_update_resource.defender_settings
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;cross-cutting&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;cross-cutting&#34;].azurerm_storage_container.container[&#34;data&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;cross-cutting&#34;].azurerm_storage_container.container[&#34;di001&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;cross-cutting&#34;].azurerm_storage_container.container[&#34;di002&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;cross-cutting&#34;].random_string.storage_account_random_string
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;cross-cutting&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;cross-cutting&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;cross-cutting&#34;].time_static.pim_start
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;cross-cutting-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;cross-cutting-dfs&#34;].azurerm_private_endpoint.this
* Update
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_database.this[&#34;MetadataControl&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-services&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-services-mysql&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_landing_zone["00"].azurerm_bastion_host.this[0] will be created
  + resource "azurerm_bastion_host" "this" {
      + copy_paste_enabled        = true
      + dns_name                  = (known after apply)
      + file_copy_enabled         = false
      + id                        = (known after apply)
      + ip_connect_enabled        = false
      + kerberos_enabled          = false
      + location                  = "uksouth"
      + name                      = "ingest00-bastion"
      + resource_group_name       = "ingest00-network-prod"
      + scale_units               = 2
      + session_recording_enabled = false
      + shareable_link_enabled    = false
      + sku                       = "Basic"
      + tags                      = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "High"
          + "environment"         = "production"
          + "startupMode"         = "always"
        }
      + tunneling_enabled         = false

      + ip_configuration {
          + name                 = "ingest00-bastion-ip-config"
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.data_landing_zone["00"].azurerm_public_ip.bastion[0] will be created
  + resource "azurerm_public_ip" "bastion" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "uksouth"
      + name                    = "ingest00-bastion-pip"
      + resource_group_name     = "ingest00-network-prod"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "High"
          + "environment"         = "production"
          + "startupMode"         = "always"
        }
    }

  # module.data_landing_zone["00"].azurerm_role_assignment.runtimes_datafactory_storage["cross-cutting"] will be created
  + resource "azurerm_role_assignment" "runtimes_datafactory_storage" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4bf62933-e968-47c7-b707-fde4567a2ca2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.data_landing_zone["00"].azurerm_role_assignment.shared_integration_datafactory_storage["cross-cutting"] will be created
  + resource "azurerm_role_assignment" "shared_integration_datafactory_storage" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5db1b6eb-6169-4d2f-84fb-fa18081d0a5c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.data_landing_zone["00"].azurerm_storage_data_lake_gen2_filesystem.this["cross-cutting"] will be created
  + resource "azurerm_storage_data_lake_gen2_filesystem" "this" {
      + default_encryption_scope = (known after apply)
      + group                    = (known after apply)
      + id                       = (known after apply)
      + name                     = "ingest00-cross-cutting-prod"
      + owner                    = (known after apply)
      + storage_account_id       = (known after apply)

      + ace (known after apply)
    }

  # module.data_landing_zone["00"].azurerm_storage_management_policy.this["cross-cutting"] will be created
  + resource "azurerm_storage_management_policy" "this" {
      + id                 = (known after apply)
      + storage_account_id = (known after apply)

      + rule {
          + enabled = true
          + name    = "default"

          + actions {
              + base_blob {
                  + delete_after_days_since_creation_greater_than                  = -1
                  + delete_after_days_since_last_access_time_greater_than          = -1
                  + delete_after_days_since_modification_greater_than              = -1
                  + tier_to_archive_after_days_since_creation_greater_than         = -1
                  + tier_to_archive_after_days_since_last_access_time_greater_than = -1
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                  + tier_to_archive_after_days_since_modification_greater_than     = -1
                  + tier_to_cold_after_days_since_creation_greater_than            = -1
                  + tier_to_cold_after_days_since_last_access_time_greater_than    = -1
                  + tier_to_cold_after_days_since_modification_greater_than        = -1
                  + tier_to_cool_after_days_since_creation_greater_than            = -1
                  + tier_to_cool_after_days_since_last_access_time_greater_than    = -1
                  + tier_to_cool_after_days_since_modification_greater_than        = 90
                }
              + snapshot {
                  + change_tier_to_archive_after_days_since_creation               = -1
                  + change_tier_to_cool_after_days_since_creation                  = 90
                  + delete_after_days_since_creation_greater_than                  = -1
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                  + tier_to_cold_after_days_since_creation_greater_than            = -1
                }
              + version {
                  + change_tier_to_archive_after_days_since_creation               = -1
                  + change_tier_to_cool_after_days_since_creation                  = 90
                  + delete_after_days_since_creation                               = -1
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                  + tier_to_cold_after_days_since_creation_greater_than            = -1
                }
            }

          + filters {
              + blob_types = [
                  + "blockBlob",
                ]
            }
        }
    }

  # module.data_landing_zone["00"].module.metadata_mssql.azurerm_mssql_database.this["MetadataControl"] will be updated in-place
  ~ resource "azurerm_mssql_database" "this" {
      ~ auto_pause_delay_in_minutes                                = 0 -> -1
        id                                                         = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Sql/servers/ingest00-metadata-mssql-prod/databases/MetadataControl"
        name                                                       = "MetadataControl"
        tags                                                       = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_network_security_group.this["bastion-nsg"] will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "ingest00-bastion-nsg-prod"
      + resource_group_name = "ingest00-network-prod"
      + security_rule       = (known after apply)
      + tags                = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "High"
          + "environment"         = "production"
          + "startupMode"         = "always"
        }
    }

  # module.data_landing_zone["00"].module.networking.azurerm_network_security_rule.deny_inbound["bastion-nsg"] will be created
  + resource "azurerm_network_security_rule" "deny_inbound" {
      + access                      = "Deny"
      + description                 = "Default DenyInbound rule"
      + destination_address_prefix  = "*"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "DenyAllInbound"
      + network_security_group_name = "ingest00-bastion-nsg-prod"
      + priority                    = 4096
      + protocol                    = "*"
      + resource_group_name         = "ingest00-network-prod"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.data_landing_zone["00"].module.networking.azurerm_network_security_rule.rules["bastion-nsg-Bastion-azure-cloud-outbound"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "Allow Bastion to talk to other Azure services."
      + destination_address_prefix  = "AzureCloud"
      + destination_port_range      = "443"
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "bastion-nsg-Bastion-azure-cloud-outbound"
      + network_security_group_name = "ingest00-bastion-nsg-prod"
      + priority                    = 503
      + protocol                    = "Tcp"
      + resource_group_name         = "ingest00-network-prod"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.data_landing_zone["00"].module.networking.azurerm_network_security_rule.rules["bastion-nsg-Bastion-data-plane-inbound"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "Allow Bastion data plane connections."
      + destination_address_prefix  = "VirtualNetwork"
      + destination_port_ranges     = [
          + "5701",
          + "8080",
        ]
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "bastion-nsg-Bastion-data-plane-inbound"
      + network_security_group_name = "ingest00-bastion-nsg-prod"
      + priority                    = 502
      + protocol                    = "*"
      + resource_group_name         = "ingest00-network-prod"
      + source_address_prefix       = "VirtualNetwork"
      + source_port_range           = "*"
    }

  # module.data_landing_zone["00"].module.networking.azurerm_network_security_rule.rules["bastion-nsg-Bastion-data-plane-outbound"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "Allow Bastion data plane connections."
      + destination_address_prefix  = "VirtualNetwork"
      + destination_port_ranges     = [
          + "5701",
          + "8080",
        ]
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "bastion-nsg-Bastion-data-plane-outbound"
      + network_security_group_name = "ingest00-bastion-nsg-prod"
      + priority                    = 502
      + protocol                    = "*"
      + resource_group_name         = "ingest00-network-prod"
      + source_address_prefix       = "VirtualNetwork"
      + source_port_range           = "*"
    }

  # module.data_landing_zone["00"].module.networking.azurerm_network_security_rule.rules["bastion-nsg-Bastion-gateway-manager-inbound"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "Allow Bastion Gateway Manager to communicate with Bastion Host."
      + destination_address_prefix  = "*"
      + destination_port_range      = "443"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "bastion-nsg-Bastion-gateway-manager-inbound"
      + network_security_group_name = "ingest00-bastion-nsg-prod"
      + priority                    = 500
      + protocol                    = "Tcp"
      + resource_group_name         = "ingest00-network-prod"
      + source_address_prefix       = "GatewayManager"
      + source_port_range           = "*"
    }

  # module.data_landing_zone["00"].module.networking.azurerm_network_security_rule.rules["bastion-nsg-Bastion-internet-outbound"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "Allow Bastion to talk to internet."
      + destination_address_prefix  = "Internet"
      + destination_port_ranges     = [
          + "443",
          + "80",
        ]
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "bastion-nsg-Bastion-internet-outbound"
      + network_security_group_name = "ingest00-bastion-nsg-prod"
      + priority                    = 504
      + protocol                    = "*"
      + resource_group_name         = "ingest00-network-prod"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.data_landing_zone["00"].module.networking.azurerm_network_security_rule.rules["bastion-nsg-Bastion-load-balancer-inbound"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "Allow Azure Load Balancer to communicate with Bastion Host."
      + destination_address_prefix  = "*"
      + destination_port_range      = "443"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "bastion-nsg-Bastion-load-balancer-inbound"
      + network_security_group_name = "ingest00-bastion-nsg-prod"
      + priority                    = 501
      + protocol                    = "Tcp"
      + resource_group_name         = "ingest00-network-prod"
      + source_address_prefix       = "AzureLoadBalancer"
      + source_port_range           = "*"
    }

  # module.data_landing_zone["00"].module.networking.azurerm_network_security_rule.rules["bastion-nsg-Bastion-user-inbound"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "Allow users to access Bastion."
      + destination_address_prefix  = "*"
      + destination_port_range      = "443"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "bastion-nsg-Bastion-user-inbound"
      + network_security_group_name = "ingest00-bastion-nsg-prod"
      + priority                    = 505
      + protocol                    = "Tcp"
      + resource_group_name         = "ingest00-network-prod"
      + source_address_prefixes     = [
          + "*",
        ]
      + source_port_range           = "*"
    }

  # module.data_landing_zone["00"].module.networking.azurerm_network_security_rule.rules["bastion-nsg-Bastion-vm-outbound"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "Allow Bastion to talk to VMs."
      + destination_address_prefix  = "VirtualNetwork"
      + destination_port_ranges     = [
          + "22",
          + "3389",
        ]
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "bastion-nsg-Bastion-vm-outbound"
      + network_security_group_name = "ingest00-bastion-nsg-prod"
      + priority                    = 505
      + protocol                    = "*"
      + resource_group_name         = "ingest00-network-prod"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.data_landing_zone["00"].module.networking.azurerm_network_security_rule.rules["nsg-Allow_Bastion"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                       = "Allow"
      + description                  = "Allow Azure Bastion to communicate with DLRM data ingest landing zone resources."
      + destination_address_prefixes = [
          + "10.247.43.0/24",
          + "10.247.44.0/24",
        ]
      + destination_port_range       = "*"
      + direction                    = "Inbound"
      + id                           = (known after apply)
      + name                         = "nsg-Allow_Bastion"
      + network_security_group_name  = "ingest00-nsg-prod"
      + priority                     = 3999
      + protocol                     = "*"
      + resource_group_name          = "ingest00-network-prod"
      + source_address_prefixes      = [
          + "10.247.43.192/26",
        ]
      + source_port_range            = "*"
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-bastion"] will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                              = [
          + "10.247.43.192/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "AzureBastionSubnet"
      + private_endpoint_network_policies             = "Enabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "ingest00-network-prod"
      + virtual_network_name                          = "ingest00-vnet-prod"
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-services"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
      ~ address_prefixes                              = [
          ~ "10.247.43.0/27" -> "10.247.43.0/26",
        ]
        id                                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-network-prod/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-prod/subnets/ingest00-services-prod"
        name                                          = "ingest00-services-prod"
        # (7 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-services-mysql"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
      ~ address_prefixes                              = [
          ~ "10.247.43.32/27" -> "10.247.43.16/28",
        ]
        id                                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-network-prod/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-prod/subnets/ingest00-services-mysql-prod"
        name                                          = "ingest00-services-mysql-prod"
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet_network_security_group_association.this["bastion-nsg-vnet-bastion"] will be created
  + resource "azurerm_subnet_network_security_group_association" "this" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this["ingest00crosscuttingprod"] will be created
  + resource "azurerm_data_factory_linked_service_azure_blob_storage" "this" {
      + data_factory_id          = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-prod"
      + id                       = (known after apply)
      + integration_runtime_name = "AutoResolveIntegrationRuntime"
      + name                     = "ingest00crosscuttingprod"
      + service_endpoint         = (sensitive value)
      + use_managed_identity     = true
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this["cross-cutting-blob"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "this" {
      + data_factory_id    = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-prod"
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-integration-dataFactory001-cross-cutting-blob-prod"
      + subresource_name   = "blob"
      + target_resource_id = (known after apply)

      + timeouts {
          + create = "60m"
        }
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this["cross-cutting-dfs"] will be created
  + resource "azurerm_data_factory_managed_private_endpoint" "this" {
      + data_factory_id    = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-prod"
      + fqdns              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-integration-dataFactory001-cross-cutting-dfs-prod"
      + subresource_name   = "dfs"
      + target_resource_id = (known after apply)

      + timeouts {
          + create = "60m"
        }
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.null_resource.private_endpoint_approvals["cross-cutting-blob"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.null_resource.private_endpoint_approvals["cross-cutting-dfs"] will be created
  + resource "null_resource" "private_endpoint_approvals" {
      + id = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["cross-cutting"].azapi_update_resource.defender_settings will be created
  + resource "azapi_update_resource" "defender_settings" {
      + body                    = {
          + properties = {
              + isEnabled                         = true
              + malwareScanning                   = {
                  + onUpload = {
                      + capGBPerMonth = 5000
                      + isEnabled     = true
                    }
                }
              + overrideSubscriptionLevelSettings = true
              + sensitiveDataDiscovery            = {
                  + isEnabled = true
                }
            }
        }
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "current"
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = (known after apply)
      + type                    = "Microsoft.Security/DefenderForStorageSettings@2022-12-01-preview"
    }

  # module.data_landing_zone["00"].module.storage["cross-cutting"].azurerm_storage_account.storage_account will be created
  + resource "azurerm_storage_account" "storage_account" {
      + access_tier                        = "Hot"
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = true
      + is_hns_enabled                     = true
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "uksouth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "ingest00crosscuttingprod"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "ingest00-main-prod"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "High"
          + "environment"         = "production"
          + "startupMode"         = "always"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = false

          + container_delete_retention_policy {
              + days = 7
            }

          + delete_retention_policy {
              + days                     = 365
              + permanent_delete_enabled = false
            }
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Deny"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = [
              + "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/ss-ptl-vnet/subnets/aks-00",
              + "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/ss-ptl-vnet/subnets/aks-01",
            ]
        }

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["cross-cutting"].azurerm_storage_container.container["data"] will be created
  + resource "azurerm_storage_container" "container" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "data"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "ingest00crosscuttingprod"
    }

  # module.data_landing_zone["00"].module.storage["cross-cutting"].azurerm_storage_container.container["di001"] will be created
  + resource "azurerm_storage_container" "container" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "di001"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "ingest00crosscuttingprod"
    }

  # module.data_landing_zone["00"].module.storage["cross-cutting"].azurerm_storage_container.container["di002"] will be created
  + resource "azurerm_storage_container" "container" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "di002"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "ingest00crosscuttingprod"
    }

  # module.data_landing_zone["00"].module.storage["cross-cutting"].random_string.storage_account_random_string will be created
  + resource "random_string" "storage_account_random_string" {
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.data_landing_zone["00"].module.storage["cross-cutting"].time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["cross-cutting"].time_static.pim_expiry will be created
  + resource "time_static" "pim_expiry" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["cross-cutting"].time_static.pim_start will be created
  + resource "time_static" "pim_start" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage_pe["cross-cutting-blob"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest00-cross-cutting-blob-pe-prod"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest00-main-prod"
      + subnet_id                = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-network-prod/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-prod/subnets/ingest00-services-prod"
      + tags                     = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "High"
          + "environment"         = "production"
          + "startupMode"         = "always"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest00crosscuttingprod"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.data_landing_zone["00"].module.storage_pe["cross-cutting-dfs"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest00-cross-cutting-dfs-pe-prod"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest00-main-prod"
      + subnet_id                = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-network-prod/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-prod/subnets/ingest00-services-prod"
      + tags                     = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "High"
          + "environment"         = "production"
          + "startupMode"         = "always"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest00crosscuttingprod"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "dfs",
            ]
        }
    }

  # module.data_landing_zone["00"].module.shir001.module.shir_vmss.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

Plan: 35 to add, 3 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":84,"Program":"tfcmt","SHA1":"","Target":"prod_landing - TerraformPlanApply","Vars":{}} -->